## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: digitalocean
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place

Terraform will perform the following actions:

  # helm_release.argocd will be updated in-place
!   resource "helm_release" "argocd" {
        id                         = "argocd"
        name                       = "argocd"
        # (27 unchanged attributes hidden)

!       set_sensitive {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

        # (1 unchanged block hidden)
    }

  # kubernetes_config_map.argocd_cm will be created
+   resource "kubernetes_config_map" "argocd_cm" {
+       data = {
+           "application.instanceLabelKey" = "argocd.argoproj.io/instance"
+           "dex.config"                   = (sensitive)
+           "url"                          = "https://argocd.wayofthesys.org"
        }
+       id   = (known after apply)

+       metadata {
+           annotations      = {
+               "meta.helm.sh/release-name"      = "argocd"
+               "meta.helm.sh/release-namespace" = "argocd"
            }
+           generation       = (known after apply)
+           labels           = {
+               "app.kubernetes.io/instance"   = "argocd"
+               "app.kubernetes.io/managed-by" = "Helm"
+               "app.kubernetes.io/name"       = "argo-cd"
+               "app.kubernetes.io/part-of"    = "argocd"
+               "helm.sh/chart"                = "argo-cd-4.1.5"
            }
+           name             = "argocd-cm"
+           namespace        = "argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:digitalocean workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| digitalocean | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
